IdeaRS.OpenModel.Material.ThermalSpecificHeatState
Type of curvature - thermal specific heat

IdeaRS.OpenModel.Material.ThermalSpecificHeatState.None
The curvature is not defined

IdeaRS.OpenModel.Material.ThermalSpecificHeatState.Code
The curvatire is defined by the code

IdeaRS.OpenModel.Material.ThermalSpecificHeatState.User
The curvature is input by the user